//Chỉ được nhập số  (hoặc và .) VD: 1, 1.3, 5.7
export const regex = {
  NumberDotRegex: /^[0-9]{1,2}([,.][0-9]{1,2})?$/,
  passRegExp: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/,
  cmndRegex: /^[0-9]{9,12}$/,
  phonePatternRegex: /^[+]*[(]{0,1}[0-9]{1,4}[)]{0,1}[-\s./0-9]*$/,
  numberRegex: /^[0-9]\d*$/,
  phoneRegex: /^[0-9]{10,11}$\d*$/,
  iphoneRegex: /^[+]*[(]{0,1}[0-9]{1,4}[)]{0,1}[-\s./0-9]*$/,
  sbdRegex: /^[0-9A-Z]{7,15}$/,
  markRegex: /(^[0-9]{1}([.][0-9]{1,2})?$)|10/,
  ctime24Regex: /^(0[0-9]|1[0-9]|2[0-3]):[0-5][0-9]$/,
};
